; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_16_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 - counter
	)
  (:init
		(= (value c0) 62)
	(= (value c1) 1)
	(= (value c2) 15)
	(= (value c3) 35)
	(= (value c4) 100)
	(= (value c5) 81)
	(= (value c6) 5)
	(= (value c7) 91)
	(= (value c8) 21)
	(= (value c9) 23)
	(= (value c10) 57)
	(= (value c11) 84)
	(= (value c12) 54)
	(= (value c13) 64)
	(= (value c14) 93)
	(= (value c15) 78)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
		)
	)
)

; plan
1. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 9 of 15
2. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 9 of 15
3. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 9 of 15
4. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 9 of 15
5. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 9 of 15
6. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 9 of 15
7. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 9 of 15
8. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 9 of 15
9. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 9 of 15
10. (increment c6)
   changed: (value c6) from 5 to 13
   goals met: 9 of 15
11. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 9 of 15
12. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 9 of 15
13. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 9 of 15
14. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 9 of 15
15. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 9 of 15
16. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 9 of 15
17. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 9 of 15
18. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 9 of 15
19. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 9 of 15
20. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 9 of 15
21. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 9 of 15
22. (increment c1)
   changed: (value c1) from 1 to 8
   goals met: 9 of 15
23. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 9 of 15
24. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 9 of 15
25. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 9 of 15
26. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 9 of 15
27. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 9 of 15
28. (increase_rate c15)
   changed: (rate_value c15) from 3 to 4
   goals met: 9 of 15
29. (increase_rate c15)
   changed: (rate_value c15) from 4 to 5
   goals met: 9 of 15
30. (increment c15)
   changed: (value c15) from 78 to 83
   goals met: 9 of 15
31. (increment c15)
   changed: (value c15) from 83 to 88
   goals met: 9 of 15
32. (increment c15)
   changed: (value c15) from 88 to 93
   goals met: 9 of 15
33. (increment c15)
   changed: (value c15) from 93 to 98
   goals met: 10 of 15
34. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 10 of 15
35. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 10 of 15
36. (decrement_rate c5)
   changed: (rate_value c5) from 1 to 0
   goals met: 10 of 15
37. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 10 of 15
38. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 10 of 15
39. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 10 of 15
40. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 10 of 15
41. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 10 of 15
42. (decrement c4)
   changed: (value c4) from 100 to 94
   goals met: 10 of 15
43. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 10 of 15
44. (decrement c4)
   changed: (value c4) from 94 to 87
   goals met: 10 of 15
45. (decrement c4)
   changed: (value c4) from 87 to 80
   goals met: 11 of 15
46. (increment c6)
   changed: (value c6) from 13 to 22
   goals met: 11 of 15
47. (increment c6)
   changed: (value c6) from 22 to 31
   goals met: 11 of 15
48. (increment c6)
   changed: (value c6) from 31 to 40
   goals met: 11 of 15
49. (increment c6)
   changed: (value c6) from 40 to 49
   goals met: 11 of 15
50. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 11 of 15
51. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 11 of 15
52. (increment c6)
   changed: (value c6) from 49 to 58
   goals met: 11 of 15
53. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 11 of 15
54. (increment c6)
   changed: (value c6) from 58 to 68
   goals met: 11 of 15
55. (increment c6)
   changed: (value c6) from 68 to 78
   goals met: 11 of 15
56. (increment c6)
   changed: (value c6) from 78 to 88
   goals met: 12 of 15
57. (increment c1)
   changed: (value c1) from 8 to 15
   goals met: 11 of 15
58. (increment c1)
   changed: (value c1) from 15 to 22
   goals met: 11 of 15
59. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 11 of 15
60. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 11 of 15
61. (increment c1)
   changed: (value c1) from 22 to 31
   goals met: 11 of 15
62. (decrement c0)
   changed: (value c0) from 62 to 58
   goals met: 11 of 15
63. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 11 of 15
64. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 11 of 15
65. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 11 of 15
66. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 11 of 15
67. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 11 of 15
68. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 11 of 15
69. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 11 of 15
70. (increment c12)
   changed: (value c12) from 54 to 60
   goals met: 11 of 15
71. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 11 of 15
72. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 11 of 15
73. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 11 of 15
74. (increment c12)
   changed: (value c12) from 60 to 67
   goals met: 10 of 15
75. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 10 of 15
76. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 10 of 15
77. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 10 of 15
78. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 10 of 15
79. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 10 of 15
80. (decrement c11)
   changed: (value c11) from 84 to 80
   goals met: 10 of 15
81. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 10 of 15
82. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 10 of 15
83. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 10 of 15
84. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 10 of 15
85. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 10 of 15
86. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 10 of 15
87. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 10 of 15
88. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 10 of 15
89. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 10 of 15
90. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 10 of 15
91. (increment c8)
   changed: (value c8) from 21 to 31
   goals met: 9 of 15
92. (increment c8)
   changed: (value c8) from 31 to 41
   goals met: 9 of 15
93. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 9 of 15
94. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 9 of 15
95. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 9 of 15
96. (decrement c8)
   changed: (value c8) from 41 to 31
   goals met: 9 of 15
97. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 9 of 15
98. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 9 of 15
99. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 9 of 15
100. (increment c8)
   changed: (value c8) from 31 to 41
   goals met: 9 of 15
101. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 9 of 15
102. (decrement c8)
   changed: (value c8) from 41 to 31
   goals met: 9 of 15
103. (decrement c7)
   changed: (value c7) from 91 to 84
   goals met: 8 of 15
104. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 8 of 15
105. (increment c8)
   changed: (value c8) from 31 to 41
   goals met: 8 of 15
106. (decrement c7)
   changed: (value c7) from 84 to 76
   goals met: 8 of 15
107. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 8 of 15
108. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 8 of 15
109. (decrement c8)
   changed: (value c8) from 41 to 31
   goals met: 8 of 15
110. (decrement c7)
   changed: (value c7) from 76 to 66
   goals met: 8 of 15
111. (decrement c8)
   changed: (value c8) from 31 to 21
   goals met: 9 of 15
112. (decrement c7)
   changed: (value c7) from 66 to 56
   goals met: 9 of 15
113. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 9 of 15
114. (increase_rate c0)
   changed: (rate_value c0) from 5 to 6
   goals met: 9 of 15
115. (decrement c1)
   changed: (value c1) from 31 to 21
   goals met: 9 of 15
116. (decrement c0)
   changed: (value c0) from 58 to 52
   goals met: 9 of 15
117. (increase_rate c0)
   changed: (rate_value c0) from 6 to 7
   goals met: 9 of 15
118. (decrement c1)
   changed: (value c1) from 21 to 11
   goals met: 10 of 15
119. (decrement c0)
   changed: (value c0) from 52 to 45
   goals met: 10 of 15
120. (increase_rate c0)
   changed: (rate_value c0) from 7 to 8
   goals met: 10 of 15
121. (increase_rate c0)
   changed: (rate_value c0) from 8 to 9
   goals met: 10 of 15
122. (increase_rate c0)
   changed: (rate_value c0) from 9 to 10
   goals met: 10 of 15
123. (increment c1)
   changed: (value c1) from 11 to 21
   goals met: 9 of 15
124. (decrement c0)
   changed: (value c0) from 45 to 35
   goals met: 9 of 15
125. (decrement c1)
   changed: (value c1) from 21 to 11
   goals met: 10 of 15
126. (decrement c0)
   changed: (value c0) from 35 to 25
   goals met: 10 of 15
127. (increment c1)
   changed: (value c1) from 11 to 21
   goals met: 9 of 15
128. (decrement c0)
   changed: (value c0) from 25 to 15
   goals met: 10 of 15
129. (decrement c1)
   changed: (value c1) from 21 to 11
   goals met: 10 of 15
130. (decrement c0)
   changed: (value c0) from 15 to 5
   goals met: 11 of 15
131. (decrement c12)
   changed: (value c12) from 67 to 57
   goals met: 12 of 15
132. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 12 of 15
133. (decrement c11)
   changed: (value c11) from 80 to 75
   goals met: 12 of 15
134. (decrement c11)
   changed: (value c11) from 75 to 70
   goals met: 12 of 15
135. (increment c12)
   changed: (value c12) from 57 to 67
   goals met: 11 of 15
136. (decrement c11)
   changed: (value c11) from 70 to 65
   goals met: 12 of 15
137. (increment c8)
   changed: (value c8) from 21 to 31
   goals met: 11 of 15
138. (increment c7)
   changed: (value c7) from 56 to 66
   goals met: 11 of 15
139. (decrement c6)
   changed: (value c6) from 88 to 78
   goals met: 10 of 15
140. (decrement c5)
   changed: (value c5) from 81 to 79
   goals met: 9 of 15
141. (decrement c5)
   changed: (value c5) from 79 to 77
   goals met: 10 of 15
142. (decrement c4)
   changed: (value c4) from 80 to 73
   goals met: 11 of 15
143. (decrement c8)
   changed: (value c8) from 31 to 21
   goals met: 12 of 15
144. (decrement_rate c7)
   changed: (rate_value c7) from 10 to 9
   goals met: 12 of 15
145. (decrement c7)
   changed: (value c7) from 66 to 57
   goals met: 12 of 15
146. (decrement c7)
   changed: (value c7) from 57 to 48
   goals met: 12 of 15
147. (decrement c7)
   changed: (value c7) from 48 to 39
   goals met: 12 of 15
148. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 12 of 15
149. (increment c8)
   changed: (value c8) from 21 to 31
   goals met: 11 of 15
150. (increment c7)
   changed: (value c7) from 39 to 49
   goals met: 11 of 15
151. (decrement c6)
   changed: (value c6) from 78 to 68
   goals met: 10 of 15
152. (decrement c5)
   changed: (value c5) from 77 to 75
   goals met: 10 of 15
153. (decrement c5)
   changed: (value c5) from 75 to 73
   goals met: 9 of 15
154. (decrement c5)
   changed: (value c5) from 73 to 71
   goals met: 9 of 15
155. (decrement c5)
   changed: (value c5) from 71 to 69
   goals met: 9 of 15
156. (decrement c5)
   changed: (value c5) from 69 to 67
   goals met: 10 of 15
157. (decrement c4)
   changed: (value c4) from 73 to 66
   goals met: 11 of 15
158. (increment c8)
   changed: (value c8) from 31 to 41
   goals met: 11 of 15
159. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 11 of 15
160. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 11 of 15
161. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 11 of 15
162. (increment c9)
   changed: (value c9) from 23 to 26
   goals met: 11 of 15
163. (increment c9)
   changed: (value c9) from 26 to 29
   goals met: 11 of 15
164. (increment c9)
   changed: (value c9) from 29 to 32
   goals met: 11 of 15
165. (increment c8)
   changed: (value c8) from 41 to 51
   goals met: 12 of 15
166. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 12 of 15
167. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 12 of 15
168. (increment c9)
   changed: (value c9) from 32 to 37
   goals met: 12 of 15
169. (increment c9)
   changed: (value c9) from 37 to 42
   goals met: 12 of 15
170. (increment c9)
   changed: (value c9) from 42 to 47
   goals met: 12 of 15
171. (increment c9)
   changed: (value c9) from 47 to 52
   goals met: 13 of 15
172. (decrement c6)
   changed: (value c6) from 68 to 58
   goals met: 12 of 15
173. (decrement c6)
   changed: (value c6) from 58 to 48
   goals met: 13 of 15
174. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 13 of 15
175. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 13 of 15
176. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 13 of 15
177. (decrement c5)
   changed: (value c5) from 67 to 62
   goals met: 12 of 15
178. (decrement c5)
   changed: (value c5) from 62 to 57
   goals met: 12 of 15
179. (decrement c5)
   changed: (value c5) from 57 to 52
   goals met: 12 of 15
180. (decrement c5)
   changed: (value c5) from 52 to 47
   goals met: 13 of 15
181. (decrement c4)
   changed: (value c4) from 66 to 59
   goals met: 13 of 15
182. (decrement c4)
   changed: (value c4) from 59 to 52
   goals met: 13 of 15
183. (decrement c4)
   changed: (value c4) from 52 to 45
   goals met: 14 of 15
184. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 14 of 15
185. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 14 of 15
186. (increment c13)
   changed: (value c13) from 64 to 66
   goals met: 14 of 15
187. (increment c13)
   changed: (value c13) from 66 to 68
   goals met: 15 of 15
